In [10]:
#solution 1
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd
data_series = pd.Series([4, 8, 15, 16, 3, 42])
print(data_series)
type(data_series)

0     4
1     8
2    15
3    16
4     3
5    42
dtype: int64

pandas.core.series.Series

In [11]:
#Solution 2
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

data_list = [1,5,11,4,7,2,6,3,55,9,45,596,]
data_series2 = pd.Series(data_list)
print(data_series2)

0       1
1       5
2      11
3       4
4       7
5       2
6       6
7       3
8      55
9       9
10     45
11    596
dtype: int64

In [19]:
dic_data = {'Name' : ['Alice', 'Bob', 'Claire'], 'Age': [25, 30, 27], 'Gender': ['Female', 'Male', 'Female']}
df = pd.DataFrame(dic_data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [1]:
#Solutiom 4
#What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

'''Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. 
For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.'''

#Series example

import pandas as pd

# Create a Pandas Series from a list
data = [1000, 2000, 3000, 4000, 5000]
s = pd.Series(data)

# Print the Series
print(s)


#DataFrame Example

# Create a DataFrame with a single column using a Python list
data = [1000, 2000, 3000, 4000, 5000]
df = pd.DataFrame(data, columns=['Column1'])

# Print the DataFrame
print(df)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64
   Column1
0     1000
1     2000
2     3000
3     4000
4     5000

In [3]:
#Solution 5
#What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#Common functions used in the Pandas DataFrame are:
#1) read_csv()
#2) head()
#3) describe()
#4) dropna()

# Example for read_csv()

import pandas as pd
 
# assign dataset
df = pd.read_csv("country_code.csv")
 
# display
print("Type-", type(df))
df

Type- <class 'pandas.core.frame.DataFrame'>

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [ ]:
#Solution 6
#Which of the following is mutable in nature Series, DataFrame, Panel?

#All three Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

In [4]:
#Solution 7
#Create a DataFrame using multiple Series. Explain with an example.

import pandas as pd
courses = pd.Series(["Spark","PySpark","Hadoop"], name='courses')
fees = pd.Series([22000,25000,23000], name='fees')
discount  = pd.Series([1000,2300,1000],name='discount')

df=pd.concat([courses,fees,discount],axis=1)
print(df)

   courses   fees  discount
0    Spark  22000      1000
1  PySpark  25000      2300
2   Hadoop  23000      1000